am/OpenFOAM-10/tutorials/incompressible/simpleFoam/turbineSiting/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          bounded Gauss upwind;
    div(phi,epsilon)    bounded Gauss upwind;
    div(phi,k)          bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited corrected 0.33;
}


// ************************************************************************* //
